
  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   16.0   Copyright 1985-2019 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     Special Edition                  College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

4-user Stata network perpetual license:
       Serial number:  501606205920
         Licensed to:  FRBNY
                       Research

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  Maximum number of variables is set to 5000; see help set_maxvar.

. do "replicate_mom_portfolios.do" 

. cd ..
/home/rcerxr21/FernandoWork/ERP_GIT/Code

. cd ..
/home/rcerxr21/FernandoWork/ERP_GIT

. 
. global dir `c(pwd)'

. global indir = "${dir}/Input"

. 
. version 16

. 
. *****************************************************************************
. * Clean CRSP data
. *****************************************************************************
. import delimited using "${indir}/crsp_m.txt", delim(" ") varnames(1) clear
Note:  233,045,549 binary zeros were ignored in the source file.  The first
       instance occurred on line 34,300.  Binary zeros are not valid in text
       data.  Inspect your data carefully.
(9 vars, 34,300 obs)

. 
. tostring date, replace
date was long now str8

. gen date2 = date(date,"YMD")

. replace date2 = mofd(date2)
(34,282 real changes made)

. format date2 %tmCCYYNN

. drop date

. rename date2 date

. order date, after(permno)

. 
. replace ret = "0" if ret == ""
(103 real changes made)

. replace ret = "" if inlist(ret,"E","D","C","B","A")
(682 real changes made)

. destring ret, replace
ret: all characters numeric; replaced as double
(682 missing values generated)

. 
. *****************************************************************************
. * Generate ME and lagged ME
. *****************************************************************************
. gen prc_adj = prc
(613 missing values generated)

. replace prc_adj = altprc if mi(prc_adj)
(36 real changes made)

. 
. * Calculate ME using prices adjusted by altprc
. gen ME = abs(prc_adj) * shrout if prc_adj ~= 0 & shrout ~= 0
(577 missing values generated)

. duplicates drop permno date prc, force

Duplicates in terms of permno date prc

(8,254 observations deleted)

. tsset permno date
       panel variable:  permno (unbalanced)
        time variable:  date, 192512 to 201912
                delta:  1 month

. gen l_ME = l.ME
(559 missing values generated)

. 
. *****************************************************************************
. * Generate average returns for firms with multiple stocks
. *****************************************************************************
. bys permco date: egen sum_ME = sum(l_ME)

. gen ret_vw = ret * l_ME / sum_ME if sum_ME ~= 0
(582 missing values generated)

. bys permco date: egen avg_ret_vw = sum(ret_vw) if ~mi(ret_vw)   // value-weig
> hted
(582 missing values generated)

. replace ret = avg_ret_vw
(23,141 real changes made, 42 to missing)

. 
. *****************************************************************************
. * Keep one observation for each permco-date pair
. *****************************************************************************
. duplicates drop permco date, force

Duplicates in terms of permco date

(0 observations are duplicates)

. tsset permco date
       panel variable:  permco (unbalanced)
        time variable:  date, 192512 to 201912
                delta:  1 month

. sort permco date

. 
. *****************************************************************************
. * Calculate prior 2-12 returns
. *****************************************************************************
. gen ret_12_2 = (1 + L12.ret)
(2,193 missing values generated)

. forval i = 2 / 11 {
  2.         replace ret_12_2 = ret_12_2 * (1 + L`i'.ret) 
  3. }
(22,443 real changes made, 99 to missing)
(22,354 real changes made, 5 to missing)
(22,356 real changes made, 5 to missing)
(22,358 real changes made, 5 to missing)
(22,359 real changes made, 3 to missing)
(22,362 real changes made, 2 to missing)
(22,357 real changes made, 3 to missing)
(22,359 real changes made, 3 to missing)
(22,369 real changes made, 2 to missing)
(22,372 real changes made, 3 to missing)

. replace ret_12_2 = (ret_12_2 - 1) * 100
(23,723 real changes made)

. 
. * replace with missing value if the criterion aren't met
. replace ret_12_2 = . if mi(l13.prc) | mi(l2.ret) | mi(l_ME) | mi(prc)
(46 real changes made, 46 to missing)

. 
. *****************************************************************************
. * Keep common stocks in NYSE, NASDAQ and AMEX
. *****************************************************************************
. * keep if stock is ordinary common and either "not further defined" or "need 
> not be further defined" (as in Fama-French)
. keep if shrcd==10 | shrcd==11
(1 observation deleted)

. 
. * keep if traded in NYSE, AMEX or Nasdaq only
. keep if exchcd==1 | exchcd==2 | exchcd==3
(401 observations deleted)

. 
. *****************************************************************************
. * Use French's breakpoints to classify portfolios
. *****************************************************************************
. preserve

. import delimited "${indir}/Prior_2-12_Breakpoints.txt", ///
> delimiter(space, collapse) varnames(nonames) rowrange(4) clear 
(22 vars, 1,125 obs)

. 
. rename v2 count

. forval i = 3 / 22 {
  2.         local percentile = (`i' - 2) * 5
  3.         rename v`i' prct`percentile'
  4. }

. 
. tostring v1, replace
v1 was long now str6

. gen date = date(v1,"YM")

. replace date = ym(year(date),month(date))
(1,124 real changes made)

. format date %tm

. drop v1

. 
. save temp.tmp, replace
(note: file temp.tmp not found)
file temp.tmp saved

. 
. restore

. merge m:1 date using temp.tmp, keep(1 3) nogen

    Result                           # of obs.
    -----------------------------------------
    not matched                           107
        from master                       107  
        from using                          0  

    matched                            25,537  
    -----------------------------------------

. 
. sort permco date

. gen p1 = 1 if ret_12_2 <= prct10 & ~mi(prct10)
(21,650 missing values generated)

. forval i = 2 / 10 {
  2.         local percentile = `i' * 10
  3.         local percentile10 = (`i' - 1) * 10
  4.         gen p`i' = 1 if ret_12_2 > prct`percentile10' & ret_12_2 <= prct`p
> ercentile'
  5. }
(23,165 missing values generated)
(23,609 missing values generated)
(23,690 missing values generated)
(23,705 missing values generated)
(23,827 missing values generated)
(23,752 missing values generated)
(23,713 missing values generated)
(23,479 missing values generated)
(22,296 missing values generated)

. 
. replace ret = ret * 100
(23,920 real changes made)

. 
. *****************************************************************************
. * Generate equal- and value-weighted portfolio returns
. *****************************************************************************
. * Equal-weighted
. cap rm "${indir}/10_Portfolios_Prior_12_2_Equal_weighted.dta"

. forval i = 1 / 10 {
  2.         preserve
  3.         collapse (mean) ret if p`i' == 1, by(date) cw
  4.         rename ret ret_`i'_rep
  5.         cap merge 1:1 date using "${indir}/10_Portfolios_Prior_12_2_Equal_
> weighted", nogen
  6.         order _all, sequential
  7.         save "${indir}/10_Portfolios_Prior_12_2_Equal_weighted", replace
  8.         restore
  9. }
(note: file /home/rcerxr21/FernandoWork/ERP_GIT/Input/10_Portfolios_Prior_12_2_
> Equal_weighted.dta not found)
file /home/rcerxr21/FernandoWork/ERP_GIT/Input/10_Portfolios_Prior_12_2_Equal_w
> eighted.dta saved
file /home/rcerxr21/FernandoWork/ERP_GIT/Input/10_Portfolios_Prior_12_2_Equal_w
> eighted.dta saved
file /home/rcerxr21/FernandoWork/ERP_GIT/Input/10_Portfolios_Prior_12_2_Equal_w
> eighted.dta saved
file /home/rcerxr21/FernandoWork/ERP_GIT/Input/10_Portfolios_Prior_12_2_Equal_w
> eighted.dta saved
file /home/rcerxr21/FernandoWork/ERP_GIT/Input/10_Portfolios_Prior_12_2_Equal_w
> eighted.dta saved
file /home/rcerxr21/FernandoWork/ERP_GIT/Input/10_Portfolios_Prior_12_2_Equal_w
> eighted.dta saved
file /home/rcerxr21/FernandoWork/ERP_GIT/Input/10_Portfolios_Prior_12_2_Equal_w
> eighted.dta saved
file /home/rcerxr21/FernandoWork/ERP_GIT/Input/10_Portfolios_Prior_12_2_Equal_w
> eighted.dta saved
file /home/rcerxr21/FernandoWork/ERP_GIT/Input/10_Portfolios_Prior_12_2_Equal_w
> eighted.dta saved
file /home/rcerxr21/FernandoWork/ERP_GIT/Input/10_Portfolios_Prior_12_2_Equal_w
> eighted.dta saved

. 
. * Value-weighted
. cap rm "${indir}/10_Portfolios_Prior_12_2_Value_weighted.dta"

. forval i = 1 / 10 {
  2.         preserve
  3.         collapse (mean) ret if p`i' == 1 [w = l_ME], by(date) cw
  4.         rename ret ret_`i'_rep
  5.         cap merge 1:1 date using "${indir}/10_Portfolios_Prior_12_2_Value_
> weighted", nogen
  6.         order _all, sequential
  7.         save "${indir}/10_Portfolios_Prior_12_2_Value_weighted", replace
  8.         restore
  9. }
(analytic weights assumed)
(note: file /home/rcerxr21/FernandoWork/ERP_GIT/Input/10_Portfolios_Prior_12_2_
> Value_weighted.dta not found)
file /home/rcerxr21/FernandoWork/ERP_GIT/Input/10_Portfolios_Prior_12_2_Value_w
> eighted.dta saved
(analytic weights assumed)
file /home/rcerxr21/FernandoWork/ERP_GIT/Input/10_Portfolios_Prior_12_2_Value_w
> eighted.dta saved
(analytic weights assumed)
file /home/rcerxr21/FernandoWork/ERP_GIT/Input/10_Portfolios_Prior_12_2_Value_w
> eighted.dta saved
(analytic weights assumed)
file /home/rcerxr21/FernandoWork/ERP_GIT/Input/10_Portfolios_Prior_12_2_Value_w
> eighted.dta saved
(analytic weights assumed)
file /home/rcerxr21/FernandoWork/ERP_GIT/Input/10_Portfolios_Prior_12_2_Value_w
> eighted.dta saved
(analytic weights assumed)
file /home/rcerxr21/FernandoWork/ERP_GIT/Input/10_Portfolios_Prior_12_2_Value_w
> eighted.dta saved
(analytic weights assumed)
file /home/rcerxr21/FernandoWork/ERP_GIT/Input/10_Portfolios_Prior_12_2_Value_w
> eighted.dta saved
(analytic weights assumed)
file /home/rcerxr21/FernandoWork/ERP_GIT/Input/10_Portfolios_Prior_12_2_Value_w
> eighted.dta saved
(analytic weights assumed)
file /home/rcerxr21/FernandoWork/ERP_GIT/Input/10_Portfolios_Prior_12_2_Value_w
> eighted.dta saved
(analytic weights assumed)
file /home/rcerxr21/FernandoWork/ERP_GIT/Input/10_Portfolios_Prior_12_2_Value_w
> eighted.dta saved

. 
. use "${indir}/10_Portfolios_Prior_12_2_Equal_weighted", clear

. outsheet using "${indir}/10_Portfolios_Prior_12_2_Equal_weighted.txt", replac
> e

. 
. use "${indir}/10_Portfolios_Prior_12_2_Value_weighted", clear

. outsheet using "${indir}/10_Portfolios_Prior_12_2_Value_weighted.txt", replac
> e

. rm temp.tmp

. 
end of do-file
